#include "matrix.h"
char *lineget(FILE *in){//на длину строки нет ограничений
	static char *s;//переменные static сохраняют свое значение при повторном вызове функции
	static int LMax;//в этой переменной храним количество выделенной под s памяти
	int begin=0;//это номер позиции в строке для загрузки очередного блока символов
	if(!LMax){//статические переменные инициализируются нулем
		s=(char*)malloc(2);//первое выделение памяти (размер минимального блока для считывания строки из файла в fgets =2)
		LMax=2;//эти значения устанавливаем при первом вызове lineget
	}
	while(fgets(s+begin,LMax-begin,in)){//туда, где закончилась  строка, полученная на предыдущей итерации, кладем следующий извлеченный из файла блок символов
		begin=LMax-1;//передвигаемся туда, где должен быть конец строки
		if(strchr(s,'\n')) //если строка считалась до конца
			break; //заканчиваем с текущей строкой
		LMax*=2; //иначе размер блока удваиваем
		s=(char *)realloc(s,LMax); //захватываем память под новый блок, автоматом будет выполнено копирование старых данных по новому адресу
		if(!s) //если память не выделена, завершаем задачу
			return 0;
	}
	if(begin==0){//сюда попадаем, только если достигнут конец файла
		free(s);//освобождаем память
		return 0;
	}
	return s;
}

int intget(char *str,int *k){//возвращает количество байт, которые прочитаны для извлечения первого числа
//из строки str, *k -- само число
	int pos=0;
	if(sscanf(str,"%d%n",k,&pos)==1)//пытаемся извлечь из строки число и записать его по адресу, на который указывает k
		return pos;// если sscanf  возвратил 1, число прочитано, а в pos получаем сдвиг по строке, необходимый для прочтения следующего числа
	if(sscanf(str,"%s",str)==1)//сюда попадаем только если достигли конца строки либо в строке встретился символ, который невозможно преобрахзовать в десятичное число
		return -1;//если sscanf вернул  1, то встретился некорректный символ
	return 0; //если строка закончилась
}

int**matrixget(FILE*in,int*n,int**m){//возвращает кривой массив, из файла in, n -- указатель количество строк (меняет значение), m -- указатель на массив длин строк кривого массива
	int NMax=1;//место под массив указателей на строки матрицы будем выделять блоками размера NMax, т.к. ограничений на количество строк нет
   	int x; char *buf;
	int pos;
   	int**matrix=0;//это тот объект, где будет храниться кривой массив
	int i=0,j;
	*m=0;
   	while(buf=lineget(in)){//получаем  строку с номером i из файла
		j=0;//номер столбца
		if(i%NMax==0){//если ранее выделенная память для matrix закончилась
			NMax*=2;//увеличим вдвое размер памяти
             		matrix=(int**)realloc(matrix,NMax*sizeof(int*));
                	*m= (int*)realloc(*m,NMax*sizeof(int));
        	}
		matrix[i]=(int *)malloc(strlen(buf)*sizeof(int)); //этого хватит для размещения всех чисел, записанных в строке buf
                while(pos=intget(buf,&x)){ //извлекаем  число из строки buf и записываем его в x
			if(pos==-1){//если при извлечении числа произошла ошибка
				del_matrix(matrix, i+1,*m); //отдаем всю захваченную под matrix память
				buf=lineget(in);//чтобы найти начало строки buf, возвращаемся в lineget
				if(buf)//если память не отдали в lineget, отдаем
					free(buf);
				return 0;//возвращаем ошибку
			}
         		matrix[i][j]=x;//кладем число в i строку j- столбец кривой матрицы
			j++;
			buf+=pos; //сдвиг по строке для извлечения следующего числа
		}
      		(*m)[i]=j; //когда закончилась строка, кладем j в массив длин
          	i++; //переходим к следующей строке
	}
	*n=i; //когда цикл, извлекающий строки из файла, закончился, запоминаем число строк
	return matrix; //возвращаем массив
}

